Repository: hzagaming/ClassGod
Catalog: ClassGod/ClassGod/Localizable.xcstrings
Source language: en
Languages: de, es, fr, ja, ko, pt, ru, zh_hans, zh_hant

# update.detail.failed
source: The update check or download could not be completed.
zh_hans: 无法完成更新检查或下载。

# update.detail.idle
source: No update check has run yet.
zh_hans: 尚未执行更新检查。

# update.detail.installer_opened
source: Follow the macOS Installer to finish updating.
zh_hans: 请按照 macOS 安装器提示完成更新。

# update.detail.installer_unavailable
source: A newer release exists, but it has no trusted PKG or DMG installer yet.
zh_hans: 已有新版本，但暂未提供可信的 PKG 或 DMG 安装包。

# update.download_install
source: Download and Install
zh_hans: 下载并安装

# update.downloading
source: Downloading installer…
zh_hans: 正在下载安装包…

# update.error.digest_mismatch
source: The installer checksum does not match the GitHub release.
zh_hans: 安装包校验值与 GitHub Release 不一致。

# update.error.invalid_download
source: The downloaded installer is invalid.
zh_hans: 下载的安装包无效。

# update.error.invalid_response
source: GitHub returned an invalid update response.
zh_hans: GitHub 返回了无效的更新响应。

# update.error.missing_installer
source: This release does not include a supported PKG or DMG installer.
zh_hans: 此版本未包含受支持的 PKG 或 DMG 安装包。

# update.error.open_installer
source: The macOS Installer could not be opened.
zh_hans: 无法打开 macOS 安装器。

# update.error.response_too_large
source: The GitHub update response is unexpectedly large.
zh_hans: GitHub 更新响应异常过大。

# update.last_checked
source: Last checked:
zh_hans: 最近检查：

# update.security_notice
source: Installers are downloaded over HTTPS and validated against GitHub metadata. macOS may still require administrator approval or a Privacy & Security confirmation.
zh_hans: 安装包通过 HTTPS 下载，并根据 GitHub 元数据进行校验。macOS 仍可能要求管理员授权或在“隐私与安全性”中确认。

# update.status.available
source: Update available
zh_hans: 发现可用更新

# update.status.checking
source: Checking for updates
zh_hans: 正在检查更新

# update.status.current
source: ClassGod is up to date
zh_hans: ClassGod 已是最新版本

# update.status.downloading
source: Downloading update
zh_hans: 正在下载更新

# update.status.failed
source: Update failed
zh_hans: 更新失败

# update.status.idle
source: Ready to check
zh_hans: 可以检查更新

# update.status.installer_opened
source: Installer opened
zh_hans: 安装器已打开

# update.status.installer_unavailable
source: Update found — installer unavailable
zh_hans: 发现更新，但安装包不可用

# update.subtitle
source: Check GitHub Releases and install the latest stable version
zh_hans: 检查 GitHub Release 并安装最新正式版本

# update.title
source: Software Update
zh_hans: 软件更新

# update.view_release
source: View Release
zh_hans: 查看 Release

# preflight.not_checked
source: Not checked yet
zh_hans: 尚未检查

# preflight.refresh.hint
source: Rechecks permissions, applications, URLs, and Carbon shortcut registration.
zh_hans: 重新检查权限、应用、URL 与 Carbon 快捷键注册状态。

# preflight.repair.title
source: QUICK REPAIR ROUTES
zh_hans: 快速修复入口

# preflight.status.attention
source: PARTIALLY ARMED
zh_hans: 部分武装

# preflight.status.blocked
source: NOT ARMED
zh_hans: 尚未武装

# preflight.status.ready
source: FULLY ARMED
zh_hans: 完全武装

# preflight.subtitle
source: Emergency switching readiness diagnostics
zh_hans: 紧急切屏就绪度诊断

# preflight.summary.accessibility
source: Preflight readiness summary
zh_hans: 预检就绪度摘要

# preflight.summary.attention
source: Switching remains available, but one or more paths need attention.
zh_hans: 切换仍可使用，但部分路径需要处理。

# preflight.summary.blocked
source: A critical requirement prevents reliable emergency switching.
zh_hans: 关键条件未满足，无法可靠执行紧急切屏。

# preflight.summary.count
source: %d of %d checks ready
zh_hans: %d/%d 项检查就绪

# preflight.summary.ready
source: Core permissions, destinations, and shortcuts are operational.
zh_hans: 核心权限、目标与快捷键均可正常工作。

# preflight.title
source: Preflight
zh_hans: 紧急切屏预检

# menu.schedule.description
source: Build a custom weekly timetable with live status and conflict detection
zh_hans: 自定义每周日程，实时查看状态并检测时间冲突

# schedule.active_now
source: ACTIVE NOW
zh_hans: 正在进行

# schedule.clear
source: No active schedule
zh_hans: 暂无进行中的日程

# schedule.clear_hint
source: Your time is clear
zh_hans: 这段时间由你自由安排

# schedule.color
source: COLOR
zh_hans: 颜色

# schedule.color.blue
source: Blue
zh_hans: 蓝色

# schedule.color.cyan
source: Cyan
zh_hans: 青色

# schedule.color.mint
source: Mint
zh_hans: 薄荷绿

# schedule.color.orange
source: Orange
zh_hans: 橙色

# schedule.color.rose
source: Rose
zh_hans: 玫红

# schedule.color.violet
source: Violet
zh_hans: 紫色

# schedule.conflict
source: Time Conflict
zh_hans: 时间冲突

# schedule.conflict_hint
source: This schedule overlaps another enabled schedule on the same day.
zh_hans: 此日程与当天另一项已启用的日程重叠。

# schedule.conflicts
source: Conflicts
zh_hans: 冲突

# schedule.delete
source: Delete
zh_hans: 删除

# schedule.delete_message
source: This schedule will be permanently deleted.
zh_hans: 此日程将被永久删除。

# schedule.delete_title
source: Delete schedule?
zh_hans: 删除此日程？

# schedule.disable
source: Disable
zh_hans: 停用

# schedule.disabled
source: Disabled
zh_hans: 已停用

# schedule.duration_minutes
source: %d min
zh_hans: %d 分钟

# schedule.duration_short
source: +%d min
zh_hans: +%d 分钟

# schedule.edit
source: Edit Schedule
zh_hans: 编辑日程

# schedule.edit_hint
source: Open the schedule editor
zh_hans: 打开日程编辑器

# schedule.editor_hint
source: Build one precise block in your weekly rhythm.
zh_hans: 为每周节奏安排一段明确的时间。

# schedule.enable
source: Enable
zh_hans: 启用

# schedule.enabled
source: Enabled
zh_hans: 已启用

# schedule.end_time
source: END TIME
zh_hans: 结束时间

# schedule.entry_count
source: %d schedules
zh_hans: %d 项日程

# schedule.free_now
source: FREE NOW
zh_hans: 当前空闲

# schedule.fri
source: FRI
zh_hans: 周五

# schedule.friday
source: Friday
zh_hans: 星期五

# schedule.invalid_time
source: Add a title and keep the schedule at least 15 minutes.
zh_hans: 请填写标题，并将日程时长设为至少 15 分钟。

# schedule.limit_reached
source: Schedule Lab supports up to 500 schedules.
zh_hans: 日程实验室最多支持 500 项日程。

# schedule.location
source: LOCATION
zh_hans: 地点

# schedule.location_placeholder
source: Room, building, or link
zh_hans: 教室、地点或链接

# schedule.minutes
source: Minutes
zh_hans: 分钟

# schedule.mon
source: MON
zh_hans: 周一

# schedule.monday
source: Monday
zh_hans: 星期一

# schedule.name
source: NAME
zh_hans: 名称

# schedule.name_placeholder
source: Schedule title
zh_hans: 日程标题

# schedule.new_entry
source: New Schedule
zh_hans: 新建日程

# schedule.no_entries
source: No schedules yet
zh_hans: 还没有日程

# schedule.no_entries_hint
source: Add a schedule to shape this day.
zh_hans: 添加一项日程，开始规划这一天。

# schedule.notes
source: NOTES
zh_hans: 备注

# schedule.remaining
source: %d min remaining
zh_hans: 剩余 %d 分钟

# schedule.sat
source: SAT
zh_hans: 周六

# schedule.saturday
source: Saturday
zh_hans: 星期六

# schedule.save
source: Save Schedule
zh_hans: 保存日程

# schedule.save_failed
source: Schedule changes could not be saved.
zh_hans: 无法保存日程更改。

# schedule.start_time
source: START TIME
zh_hans: 开始时间

# schedule.starts_in
source: Starts in %d min
zh_hans: %d 分钟后开始

# schedule.sun
source: SUN
zh_hans: 周日

# schedule.sunday
source: Sunday
zh_hans: 星期日

# schedule.thu
source: THU
zh_hans: 周四

# schedule.thursday
source: Thursday
zh_hans: 星期四

# schedule.title
source: Schedule Lab
zh_hans: 日程实验室

# schedule.today
source: TODAY
zh_hans: 今天

# schedule.total
source: Total
zh_hans: 总数

# schedule.tue
source: TUE
zh_hans: 周二

# schedule.tuesday
source: Tuesday
zh_hans: 星期二

# schedule.unknown
source: Unknown schedule
zh_hans: 未知日程

# schedule.up_next
source: UP NEXT
zh_hans: 下一项

# schedule.wed
source: WED
zh_hans: 周三

# schedule.wednesday
source: Wednesday
zh_hans: 星期三

# schedule.week
source: WEEK
zh_hans: 本周

# schedule.weekday
source: WEEKDAY
zh_hans: 星期

# schedule.weekly_signal
source: WEEKLY SIGNAL
zh_hans: 每周概览

# focus.background_hint
source: The timer keeps running when this window is closed.
zh_hans: 关闭窗口后，计时仍会继续。

# focus.current_rhythm
source: CURRENT RHYTHM
zh_hans: 当前节奏

source: FOCUS CYCLE
zh_hans: 专注循环

# focus.focused_today
source: FOCUSED TODAY
zh_hans: 今日专注

# focus.hint.focus
source: One clear task. Protect this block.
zh_hans: 只做一件明确的事，守住这段时间。

# focus.hint.long_break
source: Reset fully before the next deep block.
zh_hans: 充分恢复，再进入下一段深度专注。

# focus.hint.short_break
source: Step away briefly. Let attention recover.
zh_hans: 短暂离开，让注意力重新充电。

# focus.long_break_in
source: Long break in %d
zh_hans: 距离长休息还有 %d 轮

# focus.long_break_active
source: Long break active
zh_hans: 长休息进行中

# focus.minutes_value
source: %d min
zh_hans: %d 分钟

# focus.pause
source: Pause
zh_hans: 暂停

# focus.phase.focus
source: FOCUS
zh_hans: 专注

# focus.phase.long_break
source: LONG BREAK
zh_hans: 长休息

# focus.phase.short_break
source: SHORT BREAK
zh_hans: 短休息

# focus.preset.classic
source: Classic
zh_hans: 经典

# focus.preset.deep
source: Deep
zh_hans: 深度

# focus.preset.quick
source: Quick
zh_hans: 快速

# focus.preset_value
source: %d / %d min
zh_hans: %d / %d 分钟

# focus.reset
source: Reset
zh_hans: 重置

# focus.resume
source: Resume
zh_hans: 继续

# focus.rhythm
source: RHYTHM
zh_hans: 节奏预设

# focus.sessions_today
source: SESSIONS TODAY
zh_hans: 今日轮次

# focus.sessions_value
source: %d complete
zh_hans: %d 轮

# focus.skip
source: Skip Phase
zh_hans: 跳过阶段

# focus.start
source: Start Focus
zh_hans: 开始专注

# focus.state.idle
source: READY
zh_hans: 就绪

# focus.state.paused
source: PAUSED
zh_hans: 已暂停

# focus.state.running
source: RUNNING
zh_hans: 进行中

# focus.subtitle
source: FOCUS CYCLE // LOCAL
zh_hans: 专注循环 // 本地运行

# focus.title
source: Focus Flow
zh_hans: 专注流

# menu.focus.description
source: Drift-free focus and recovery cycles
zh_hans: 无漂移的专注与恢复循环

# section.uninstall
source: Complete Uninstall
zh_hans: 完全卸载

# setting.accent_color
source: Accent Color
zh_hans: 强调色

# setting.accent_color.subtitle
source: Keep the black base and customize interface highlights
zh_hans: 保持黑色底色，自定义界面高亮颜色

# setting.accent_preset
source: Accent color preset
zh_hans: 强调色预设

# uninstall.action
source: Completely Uninstall ClassGod
zh_hans: 完全卸载 ClassGod

# uninstall.action.subtitle
source: Remove the app, helper, all owned data, privacy decisions, and package receipt
zh_hans: 移除应用、辅助工具、全部自有数据、隐私权限决定和安装收据

# uninstall.cleanup.data
source: Delete preferences, caches, history, wallpapers, and Widget data
zh_hans: 删除偏好、缓存、历史记录、壁纸与 Widget 数据

# uninstall.cleanup.helper
source: Stop and remove the privileged helper and LaunchDaemon
zh_hans: 停止并移除特权 Helper 与 LaunchDaemon

# uninstall.cleanup.permissions
source: Reset all ClassGod privacy permissions
zh_hans: 重置 ClassGod 的全部隐私权限记录

# uninstall.cleanup.receipt
source: Forget the installer receipt and remove the app bundle
zh_hans: 清除安装收据并删除应用本体

# uninstall.confirm.continue
source: Continue
zh_hans: 继续

# uninstall.confirm.message
source: This removes all ClassGod-owned data and cannot be undone. A second confirmation and administrator approval are still required.
zh_hans: 这会删除 ClassGod 拥有的全部数据且无法撤销。继续后仍需第二次确认和管理员授权。

# uninstall.confirm.title
source: Completely uninstall ClassGod?
zh_hans: 确认完全卸载 ClassGod？

# uninstall.error.failed
source: The uninstall command failed.
zh_hans: 卸载命令执行失败。

# uninstall.error.invalid_installation
source: Complete uninstall is available only when ClassGod is installed in /Applications.
zh_hans: 只有安装在 /Applications 中的 ClassGod 才能执行完全卸载。

# uninstall.error.script
source: Could not create the authorized uninstall script.
zh_hans: 无法创建管理员卸载脚本。

# uninstall.error.title
source: Uninstall Failed
zh_hans: 卸载失败

# uninstall.final.action
source: Uninstall Now
zh_hans: 立即卸载

# uninstall.final.message
source: Final confirmation: ClassGod will quit immediately and remove its app bundle and all owned data after administrator approval.
zh_hans: 最终确认：管理员授权后，ClassGod 将立即退出，并删除应用本体和全部自有数据。

# uninstall.final.title
source: Are you absolutely sure?
zh_hans: 再次确认，确定要彻底卸载？

# uninstall.in_progress
source: Waiting for administrator approval…
zh_hans: 正在等待管理员授权…
